---
kind: property
id: P:Autodesk.Revit.DB.ExternalResourceTypes.BuiltInExternalResourceTypes.DecalCutOut
source: html/1979f735-4898-0b29-0ea2-dc09ec7d25ed.htm
---
# Autodesk.Revit.DB.ExternalResourceTypes.BuiltInExternalResourceTypes.DecalCutOut Property

An external resource type representing Decal linked data for cut out opacity.
 This type is reserved for future expansion but not yet implemented.

## Syntax (C#)
```csharp
public static ExternalResourceType DecalCutOut { get; }
```